Revit 2026 API

# RebarFreeFormAccessorGetCustomDistributionPath Method

---

Gets the custom distribution path for free form rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<Curve> GetCustomDistributionPath()
```
```vb
Public Function GetCustomDistributionPath As IList(Of Curve)
```
```cpp
public:
IList<Curve^>^ GetCustomDistributionPath()
```
```fsharp
member GetCustomDistributionPath : unit -> IList<Curve>
```

#### Return Value

IListCurve Returns an array of curves that represent the distribution path.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This RebarFreeFormAccessor doesn't contain a valid rebar reference. -or- This RebarFreeFormAccessor Rebar doesn't contain a valid server GUID. |

For a free form rebar set the distance between two consecutive bars may be different if it is calculated between different points on bars. The distribution path is an array of curves with the property that based on these curves the set was calculated to respect the layout rule and number of bars or spacing.

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace